Repository: mrachinskiy/sidekick
Catalog: localization/*.po
Languages: ru_ru

source: Problems
ru_ru: Проблемы

source: Ignored
ru_ru: Проигнорированные

source: Overlay Style
ru_ru: Стиль Наложения

source: Detailed
ru_ru: Детализированный

source: Compact
ru_ru: Компактный

source: Show full list of problems
ru_ru: Показать полный список проблем

source: Show only number of problems
ru_ru: Показать только количество проблем

source: Show problem description
ru_ru: Показать описание проблемы

source: Select visible objects with detected problem
ru_ru: Выделмть видимые объекты с обнаруженной проблемой

source: Can't select hidden or unselectable objects
ru_ru: Невозможно выделить скрытые или невыделяемые объекты

source: Specify problems to ignore for selected objects
ru_ru: Укажите игнорируемые проблемы для выделенных объектов

# Operator
source: Sidekick Ignore
ru_ru: Sidekick игнорировать

source: Scaled object
ru_ru: Масштабированный объект

source: Object scaling could lead to unexpected results when using certain tools and modifiers. Recommendation: if you did not set object scale on purpose use Object > Apply > Scale.
ru_ru: Масштабирование объекта может привести к неожиданным результатам при использовании определенных инструментов и модификаторов. Рекомендация: если вы не указывали масштаб объекта намеренно используйте Object > Apply > Scale.

source: Empty object
ru_ru: Пустой объект

source: Mesh or curve object missing object data. Recommendation: delete empty objects.
ru_ru: В объекте mesh или кривой отсутсвует объектная информация Рекомендация: удалите пустые объекты.

source: Modifier order is incorrect
ru_ru: Неверный порядок модификаторов

source: Generally Subdivision modifier should be placed before deform modifiers. Example: * Mirror * Subdivision * Lattice * Curve Recommendation: place Subdivision modifier before deform modifiers, unless you did it on purpose to achieve specific result.
ru_ru: Обычно модификатор Subdivision следует размещать перед модификаторами деформации. Пример: * Mirror * Subdivision * Lattice * Curve Рекомендация: переместите модификатор Subdivision перед модификаторами деформации, кроме случаев когда вы сделали это специально для достижения определенного результата.

source: Curve Radius deformation
ru_ru: Деформация Radius кривой

source: Curve Radius scales objects deformed by Curve modifier. Recommendation: disable curve Radius property, unless you are using it on purpose.
ru_ru: Radius кривой масштабирует объекты с модификатором Curve. Рекомендация: отключите параметр Radius кривой, в случае если вы специально его не используете.

source: Curve low Order
ru_ru: Значение кривой Order слишком низкое

source: Low Order property makes curve shape angular. Recommendation: set Object Data > Active Spline > Order U property to 5, if you need angular curve, then you better off using Bezier curves.
ru_ru: Низкое значение параметра Order делает форму кривой угловатой. Рекомендация: выставите параметр Object Data > Active Spline > Order U в значение 5, если же вам нужна кривая с острыми углами, то лучше используйте кривую Bezier.

source: Curve low Resolution
ru_ru: Низкая детализация кривой

source: Low Resolution property makes deformed object look low poly regardless of its polycount. Recommendation: set Object Data > Shape > Resolution Preview U property to a greater value.
ru_ru: Низкая детализация кривой придаёт низкополигональный вид деформируемому объекту, вне зависимости от количества полигонов. Рекомендация: выставите параметр Object Data > Shape > Resolution Preview U в более высокое значение.

source: Collection uses default name
ru_ru: Коллекция использует имя по умолчанию

source: Default collection names make it difficult to understand scene hierarchy for other people and yourself. Recommendation: give descriptive names to all collections.
ru_ru: Стандартные имена коллекций затрудняют понимание иерархии сцены. Рекомендация: датйте выразительные имена всем коллекциям.

source: Collection visibility
ru_ru: Видимость коллекции

source: Gems from hidden collections will appear in Design Report and Gem Map, this happens when collection is hidden with Hide in Viewport (eye icon). Recommendation: instead use Disable in Viewports (display icon) or Exclude from View Layer (checkbox).
ru_ru: Камни из скрытых коллекций будут появляться в Design Report и Gem Map, это происходит, когда коллекция скрыта с помощью Hide in Viewport (иконка глаза). Рекомендация: для скрытия коллекций используйте Disable in Viewports (иконка дисплея) или Exclude from View Layer (чекбокс).

source: Cyclic dependency
ru_ru: Циклическая зависимость

source: Using the same object as a target for Shrinkwrap and Boolean modifiers creates cyclic dependency. Recommendation: use a duplicate object without Boolean modifier as a target in Shrinkwrap modifier.
ru_ru: Использование одного объекта в качестве цели для модификаторов Shrinkwrap и Boolean создаёт циклическую зависимость. Рекомендация: используйте дубликат объекта без модификатора Boolean как цель для проецирования в Shrinkwrap.
